Revit 2027 API
BuiltInFailures.OverlapFailures.ELASeparationLinesOverlap Property
 Highlighted area based load boundary lines overlap. One of them may be ignored when Revit finds load area boundaries. Delete one of the lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ELASeparationLinesOverlap { get; }
Public Shared ReadOnly Property ELASeparationLinesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ELASeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
static member ELASeparationLinesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace